AvatarBg111/stm32h750_i2s_to_dac_converter/SEGGER_version/Source/stm32h750_init.c
/** INCLUDES **/
#include "stm32h750_init.h"
#include "stm32h7xx.h"
#include <stdint.h>
#include <stdio.h>

/** DEFINES **/
#if(0)
#define PWM_TIM1
#define PWM_TIM2
#endif

/** VARIABLES **/
DAC_HandleTypeDef dac1 = {0};
ADC_HandleTypeDef adc1 = {0};
ADC_HandleTypeDef adc2 = {0};
ADC_HandleTypeDef adc12 = {0};
TIM_HandleTypeDef tim1 = {0};
TIM_HandleTypeDef tim2 = {0};
TIM_HandleTypeDef tim3 = {0};
TIM_HandleTypeDef tim4 = {0};
TIM_HandleTypeDef tim8 = {0};
TIM_OC_InitTypeDef PWM_Config = {0};
TIM_OC_InitTypeDef PWM_Config2 = {0};
UART_HandleTypeDef uart5 = {0};
SPI_HandleTypeDef spi1 = {0};
DMA_HandleTypeDef dma_adc1 = {0};
DMA_HandleTypeDef dma_adc2 = {0};
DMA_HandleTypeDef DMA_InitStructure = {0};
RTC_HandleTypeDef hrtc = {0};

uint8_t uart5_tx_buf[] = "STM32H750VBT6\r\n";
uint8_t uart5_rx_buf[200];
uint8_t uart5_rx_cnt = 0;

/** FUNCTIONS **/
void SystemClock_Config(){
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);
  while (!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY));

  __HAL_RCC_PLL_PLLSOURCE_CONFIG(RCC_PLLSOURCE_HSI);
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK){
    Error_Handler();
  }

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_D3PCLK1 | RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK){
    Error_Handler();
  }
}

void Init_DAC12() {
  DAC_ChannelConfTypeDef dac_conf;
  GPIO_InitTypeDef dac_pin;

  __HAL_RCC_GPIOA_CLK_ENABLE();
  dac_pin.Pin = GPIO_PIN_4;
  dac_pin.Mode = GPIO_MODE_ANALOG;
  dac_pin.Pull = GPIO_NOPULL;
  dac_pin.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOA, &dac_pin);

  __HAL_RCC_DAC12_CLK_ENABLE();
  dac1.Instance = DAC1;
  HAL_DAC_Init(&dac1);

  dac_conf.DAC_SampleAndHold = DAC_SAMPLEANDHOLD_DISABLE;
  dac_conf.DAC_Trigger = DAC_TRIGGER_NONE;
  dac_conf.DAC_OutputBuffer = DAC_OUTPUTBUFFER_DISABLE;
  dac_conf.DAC_ConnectOnChipPeripheral = DAC_CHIPCONNECT_EXTERNAL;
  dac_conf.DAC_UserTrimming = DAC_TRIMMING_USER;
  dac_conf.DAC_TrimmingValue = 0x01;
  HAL_DAC_ConfigChannel(&dac1, &dac_conf, DAC_CHANNEL_1);

  __HAL_DAC_ENABLE(&dac1, DAC_CHANNEL_1);
  HAL_DAC_Start(&dac1, DAC_CHANNEL_1);
  HAL_DAC_SetValue(&dac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, 225);
}

void Init_ADC1() {
  //ADC_MultiModeTypeDef multimode;
  ADC_ChannelConfTypeDef adc_ch_conf;
  GPIO_InitTypeDef adc_pin;

  /** ADC1 PIN CHANNEL 5**/
  adc_pin.Pin = GPIO_PIN_1;
  adc_pin.Mode = GPIO_MODE_ANALOG;
  adc_pin.Pull = GPIO_NOPULL;
  adc_pin.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOB, &adc_pin);

  adc1.Instance = ADC1;
  adc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV1; /** DON'T MAKE STRUCT FOR ARGUMENT IN STRUCT, JUST USE THE INITIAL STRUCT **/
  adc1.Init.Resolution = ADC_RESOLUTION_10B;           /**   THERE IS NO TRIGGER EDGE WHEN SOFTWARE START IS CHOSEN FOR TRIGGER  **/
  adc1.Init.ScanConvMode = ADC_SCAN_DISABLE;           /**    DON'T MAKE THE STUPID MISTAKE TO PUT "ENABLE" ON OVERSAMPLING MODE **/
  adc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;        /**  YOU CAN ADD MULTIMODE CONFIGURATION, BUT YOU CAN GO WITHOUT IT TOO   **/
  adc1.Init.LowPowerAutoWait = DISABLE;                /**       YOU DON'T NEED TO CONFIGURE RIGHT SHIFT, YOU DON'T NEED IT      **/
  adc1.Init.ContinuousConvMode = ENABLE;               /**  FOR THE FUTURE, DON'T FORGET TO CHECK WHAT STATUS FUNCTIONS RETURN   **/
  adc1.Init.DiscontinuousConvMode = DISABLE;
  adc1.Init.NbrOfConversion = 0x1;
  adc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  adc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  adc1.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DR;
  adc1.Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
  adc1.Init.LeftBitShift = ADC_LEFTBITSHIFT_NONE;
  adc1.Init.OversamplingMode = DISABLE;

  if (HAL_ADC_Init(&adc1) != HAL_OK)
    Error_Handler();
  /*multimode.Mode = ADC_DUALMODE_REGSIMULT;
    multimode.DualModeData = ADC_DUALMODEDATAFORMAT_32_10_BITS;
    multimode.TwoSamplingDelay = ADC_TWOSAMPLINGDELAY_9CYCLES;
    if(HAL_ADCEx_MultiModeConfigChannel(&adc1, &multimode) != HAL_OK)    Error_Handler();*/

  adc_ch_conf.Channel = ADC_CHANNEL_5;
  adc_ch_conf.Rank = ADC_REGULAR_RANK_1;
  adc_ch_conf.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;
  adc_ch_conf.SingleDiff = ADC_SINGLE_ENDED;
  adc_ch_conf.OffsetNumber = ADC_OFFSET_NONE;
  adc_ch_conf.Offset = 0x0;
  adc_ch_conf.OffsetSignedSaturation = DISABLE;
  if (HAL_ADC_ConfigChannel(&adc1, &adc_ch_conf) != HAL_OK)
    Error_Handler();

  //    adc1.Instance = ADC1;
  //    adc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;    /** DON'T MAKE STRUCT FOR ARGUMENT IN STRUCT, JUST USE THE INITIAL STRUCT **/
  //    adc1.Init.Resolution = ADC_RESOLUTION_16B;              /**   THERE IS NO TRIGGER EDGE WHEN SOFTWARE START IS CHOSEN FOR TRIGGER  **/
  //    adc1.Init.ScanConvMode = ADC_SCAN_DISABLE;              /**    DON'T MAKE THE STUPID MISTAKE TO PUT "ENABLE" ON OVERSAMPLING MODE **/
  //    adc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;           /**  YOU CAN ADD MULTIMODE CONFIGURATION, BUT YOU CAN GO WITHOUT IT TOO   **/
  //    adc1.Init.LowPowerAutoWait = DISABLE;                   /**       YOU DON'T NEED TO CONFIGURE RIGHT SHIFT, YOU DON'T NEED IT      **/
  //    adc1.Init.ContinuousConvMode = ENABLE;                  /**  FOR THE FUTURE, DON'T FORGET TO CHECK WHAT STATUS FUNCTIONS RETURN   **/
  //    adc1.Init.DiscontinuousConvMode = DISABLE;
  //    adc1.Init.NbrOfConversion = 0x1;
  //    adc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  //    adc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
  //    adc1.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DR;
  //    adc1.Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
  //    adc1.Init.LeftBitShift = ADC_LEFTBITSHIFT_NONE;
  //    adc1.Init.OversamplingMode = DISABLE;

  /*    adc_ch_conf.Channel = ADC_CHANNEL_5;
    adc_ch_conf.Rank = ADC_REGULAR_RANK_1;
    adc_ch_conf.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;
    adc_ch_conf.SingleDiff = ADC_SINGLE_ENDED;
    adc_ch_conf.OffsetNumber = ADC_OFFSET_NONE;
    adc_ch_conf.Offset = 0x0;
    adc_ch_conf.OffsetSignedSaturation = DISABLE;
    if(HAL_ADC_ConfigChannel(&adc1, &adc_ch_conf) != HAL_OK)    Error_Handler();

    if(HAL_ADCEx_Calibration_Start(&adc1, ADC_CALIB_OFFSET_LINEARITY, ADC_SINGLE_ENDED) != HAL_OK)    Error_Handler();
    HAL_NVIC_SetPriority(ADC_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(ADC_IRQn);*/
}

void Init_ADC2() {
  ADC_ChannelConfTypeDef adc_ch_conf;
  GPIO_InitTypeDef adc_pin;

  /** ADC2 PIN CHANNEL 7**/
  adc_pin.Pin = GPIO_PIN_7;
  adc_pin.Mode = GPIO_MODE_ANALOG;
  adc_pin.Pull = GPIO_NOPULL;
  adc_pin.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOA, &adc_pin);

