AvatarBg111/stm32h750_i2s_to_dac_converter/SEGGER_version/Source/stm32h750_init.c
  //__HAL_RCC_ADC12_CLK_ENABLE();
  adc2.Instance = ADC2;
  adc2.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV1; /** DON'T MAKE STRUCT FOR ARGUMENT IN STRUCT, JUST USE THE INITIAL STRUCT **/
  adc2.Init.Resolution = ADC_RESOLUTION_10B;           /**   THERE IS NO TRIGGER EDGE WHEN SOFTWARE START IS CHOSEN FOR TRIGGER  **/
  adc2.Init.ScanConvMode = ADC_SCAN_DISABLE;           /**    DON'T MAKE THE STUPID MISTAKE TO PUT "ENABLE" ON OVERSAMPLING MODE **/
  adc2.Init.EOCSelection = ADC_EOC_SINGLE_CONV;        /**  YOU CAN ADD MULTIMODE CONFIGURATION, BUT YOU CAN GO WITHOUT IT TOO   **/
  adc2.Init.LowPowerAutoWait = DISABLE;                /**       YOU DON'T NEED TO CONFIGURE RIGHT SHIFT, YOU DON'T NEED IT      **/
  adc2.Init.ContinuousConvMode = ENABLE;               /**  FOR THE FUTURE, DON'T FORGET TO CHECK WHAT STATUS FUNCTIONS RETURN   **/
  adc2.Init.DiscontinuousConvMode = DISABLE;
  adc2.Init.NbrOfConversion = 0x1;
  adc2.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  adc2.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  adc2.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DR;
  adc2.Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
  adc2.Init.LeftBitShift = ADC_LEFTBITSHIFT_NONE;
  adc2.Init.OversamplingMode = DISABLE;

  adc_ch_conf.Channel = ADC_CHANNEL_7;
  adc_ch_conf.Rank = ADC_REGULAR_RANK_1;
  adc_ch_conf.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;
  adc_ch_conf.SingleDiff = ADC_SINGLE_ENDED;
  adc_ch_conf.OffsetNumber = ADC_OFFSET_NONE;
  adc_ch_conf.Offset = 0x0;
  adc_ch_conf.OffsetSignedSaturation = DISABLE;
  if (HAL_ADC_ConfigChannel(&adc2, &adc_ch_conf) != HAL_OK)
    Error_Handler();
}

void Init_ADC12() {
  ADC_MultiModeTypeDef multimode;
  ADC_ChannelConfTypeDef adc_ch_conf;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
  GPIO_InitTypeDef adc_pin;

  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInitStruct.PLL2.PLL2M = 4;
  PeriphClkInitStruct.PLL2.PLL2N = 9;
  PeriphClkInitStruct.PLL2.PLL2P = 4;
  PeriphClkInitStruct.PLL2.PLL2Q = 2;
  PeriphClkInitStruct.PLL2.PLL2R = 2;
  PeriphClkInitStruct.PLL2.PLL2RGE = RCC_PLL2VCIRANGE_3;
  PeriphClkInitStruct.PLL2.PLL2VCOSEL = RCC_PLL2VCOMEDIUM;
  PeriphClkInitStruct.PLL2.PLL2FRACN = 3072;
  PeriphClkInitStruct.AdcClockSelection = RCC_ADCCLKSOURCE_PLL2;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    Error_Handler();

  /** ADC1/2 PIN **/
  adc_pin.Pin = GPIO_PIN_0 | GPIO_PIN_1;
  adc_pin.Mode = GPIO_MODE_ANALOG;
  adc_pin.Pull = GPIO_PULLUP;
  adc_pin.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOB, &adc_pin);

  __HAL_RCC_ADC12_CLK_ENABLE();
  adc12.Instance = ADC1;
  adc12.Init.ClockPrescaler = ADC_CLOCK_ASYNC_DIV1; /** DON'T MAKE STRUCT FOR ARGUMENT IN STRUCT, JUST USE THE INITIAL STRUCT **/
  adc12.Init.Resolution = ADC_RESOLUTION_16B;       /**   THERE IS NO TRIGGER EDGE WHEN SOFTWARE START IS CHOSEN FOR TRIGGER  **/
  adc12.Init.ScanConvMode = ADC_SCAN_DISABLE;       /**    DON'T MAKE THE STUPID MISTAKE TO PUT "ENABLE" ON OVERSAMPLING MODE **/
  adc12.Init.EOCSelection = ADC_EOC_SINGLE_CONV;    /**  YOU CAN ADD MULTIMODE CONFIGURATION, BUT YOU CAN GO WITHOUT IT TOO   **/
  adc12.Init.LowPowerAutoWait = DISABLE;            /**       YOU DON'T NEED TO CONFIGURE RIGHT SHIFT, YOU DON'T NEED IT      **/
  adc12.Init.ContinuousConvMode = DISABLE;          /**  FOR THE FUTURE, DON'T FORGET TO CHECK WHAT STATUS FUNCTIONS RETURN   **/
  adc12.Init.NbrOfConversion = 0x1;
  adc12.Init.ExternalTrigConv = ADC_EXTERNALTRIG_T3_TRGO;
  adc12.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
  adc12.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DMA_ONESHOT;
  adc12.Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;
  adc12.Init.LeftBitShift = ADC_LEFTBITSHIFT_NONE;
  adc12.Init.OversamplingMode = DISABLE;
  if (HAL_ADC_Init(&adc12) != HAL_OK)
    Error_Handler();
  adc12.Instance = ADC2;
  if (HAL_ADC_Init(&adc12) != HAL_OK)
    Error_Handler();
  adc12.Instance = ADC1;

  adc_ch_conf.Channel = ADC_CHANNEL_5;
  adc_ch_conf.Rank = ADC_REGULAR_RANK_1;
  adc_ch_conf.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;
  adc_ch_conf.SingleDiff = ADC_SINGLE_ENDED;
  adc_ch_conf.OffsetNumber = ADC_OFFSET_NONE;
  adc_ch_conf.Offset = 0x0;
  adc_ch_conf.OffsetSignedSaturation = DISABLE;
  if (HAL_ADC_ConfigChannel(&adc12, &adc_ch_conf) != HAL_OK)
    Error_Handler();

  adc12.Instance = ADC2;
  adc_ch_conf.Channel = ADC_CHANNEL_9;
  if (HAL_ADC_ConfigChannel(&adc12, &adc_ch_conf) != HAL_OK)
    Error_Handler();

  adc12.Instance = ADC1;
  multimode.Mode = ADC_DUALMODE_INTERL;
  //multimode.Mode = ADC_DUALMODE_REGSIMULT;
  multimode.DualModeData = ADC_DUALMODEDATAFORMAT_32_10_BITS;
  multimode.TwoSamplingDelay = ADC_TWOSAMPLINGDELAY_1CYCLE;
  if (HAL_ADCEx_MultiModeConfigChannel(&adc12, &multimode) != HAL_OK)
    Error_Handler();

#if (0)
  __HAL_RCC_DMA1_CLK_ENABLE();
  dma_adc1.Instance = DMA1_Stream0;
  dma_adc1.Init.Request = DMA_REQUEST_ADC1;
  dma_adc1.Init.Direction = DMA_PERIPH_TO_MEMORY;
  dma_adc1.Init.PeriphInc = DMA_PINC_DISABLE;
  dma_adc1.Init.MemInc = DMA_MINC_ENABLE;
  dma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
  dma_adc1.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
  dma_adc1.Init.Mode = DMA_NORMAL;
  dma_adc1.Init.Priority = DMA_PRIORITY_LOW;
  dma_adc1.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
  dma_adc1.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL;
  dma_adc1.Init.MemBurst = DMA_MBURST_SINGLE;
  dma_adc1.Init.PeriphBurst = DMA_PBURST_SINGLE;
  if (HAL_DMA_Init(&dma_adc1) != HAL_OK)
    Error_Handler();
  __HAL_LINKDMA(&adc12, DMA_Handle, dma_adc1);

  adc12.Instance = ADC2;
  dma_adc2.Instance = DMA1_Stream2;
  dma_adc2.Init.Request = DMA_REQUEST_ADC2;
  dma_adc2.Init.Direction = DMA_PERIPH_TO_MEMORY;
  dma_adc2.Init.PeriphInc = DMA_PINC_DISABLE;
  dma_adc2.Init.MemInc = DMA_MINC_ENABLE;
  dma_adc2.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  dma_adc2.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
  dma_adc2.Init.Mode = DMA_NORMAL;
  dma_adc2.Init.Priority = DMA_PRIORITY_LOW;
  dma_adc2.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
  dma_adc2.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL;
  dma_adc2.Init.MemBurst = DMA_MBURST_SINGLE;
  dma_adc2.Init.PeriphBurst = DMA_PBURST_SINGLE;
  if (HAL_DMA_Init(&dma_adc2) != HAL_OK)
    Error_Handler();
  __HAL_LINKDMA(&adc12, DMA_Handle, dma_adc2);

  HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
  HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, 1, 1);
  HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);

  HAL_NVIC_SetPriority(ADC_IRQn, 1, 2);
  HAL_NVIC_EnableIRQ(ADC_IRQn);
#endif
}

void Init_TIM1() {
  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};
#ifdef NORMAL_TIM1
  __HAL_RCC_TIM1_CLK_ENABLE();
  tim1.Instance = TIM1;
  tim1.Init.Prescaler = 0;
  tim1.Init.CounterMode = TIM_COUNTERMODE_UP;
  tim1.Init.Period = 200;
  tim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV2;
  tim1.Init.RepetitionCounter = 0;
  tim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&tim1) != HAL_OK)
    Error_Handler();

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&tim1, &sClockSourceConfig) != HAL_OK)
    Error_Handler();

