AvatarBg111/stm32h750_i2s_to_dac_converter/SEGGER_version/Source/stm32h750_init.c
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&tim1, &sMasterConfig) != HAL_OK)
    Error_Handler();

  HAL_NVIC_SetPriority(TIM1_UP_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(TIM1_UP_IRQn);
#endif

#ifdef PWM_TIM1
  GPIO_InitTypeDef tim1_pin;

  /** TIM1 PWM PIN **/
  __HAL_RCC_GPIOE_CLK_ENABLE();
  tim1_pin.Pin = GPIO_PIN_14;
  tim1_pin.Mode = GPIO_MODE_AF_PP;
  tim1_pin.Pull = GPIO_PULLUP;
  tim1_pin.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  tim1_pin.Alternate = GPIO_AF1_TIM1;
  HAL_GPIO_Init(GPIOE, &tim1_pin);

  __HAL_RCC_TIM1_CLK_ENABLE();
  tim1.Instance = TIM1;
  tim1.Init.Prescaler = 355;
  tim1.Init.CounterMode = TIM_COUNTERMODE_UP;
  tim1.Init.Period = 3600;
  tim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1; /** SYSTEM FREQUENCY / 1 = 64MHz **/
  tim1.Init.RepetitionCounter = 0;
  tim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_PWM_Init(&tim1) != HAL_OK)
    Error_Handler();

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&tim1, &sClockSourceConfig) != HAL_OK)
    Error_Handler();

  PWM_Config.OCMode = TIM_OCMODE_PWM1;
  PWM_Config.Pulse = 110;
  PWM_Config.OCPolarity = TIM_OCPOLARITY_HIGH;
  PWM_Config.OCFastMode = TIM_OCFAST_DISABLE;
  PWM_Config.OCIdleState = TIM_OCIDLESTATE_RESET;
  PWM_Config.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  if (HAL_TIM_PWM_ConfigChannel(&tim1, &PWM_Config, TIM_CHANNEL_4) != HAL_OK)
    Error_Handler();

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&tim1, &sMasterConfig) != HAL_OK)
    Error_Handler();
#endif
}

void Init_TIM2() {
  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};
  GPIO_InitTypeDef tim2_pin;

  /** TIM2 PWM PIN **/
  tim2_pin.Pin = GPIO_PIN_11;
  tim2_pin.Mode = GPIO_MODE_AF_PP;
  tim2_pin.Pull = GPIO_PULLUP;
  tim2_pin.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  tim2_pin.Alternate = GPIO_AF1_TIM2;
  HAL_GPIO_Init(GPIOB, &tim2_pin);

  __HAL_RCC_TIM2_CLK_ENABLE();
  tim2.Instance = TIM2;
  tim2.Init.Prescaler = 355;
  tim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  tim2.Init.Period = 3600;
  tim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1; /** SYSTEM FREQUENCY / 1 = 64MHz **/
  tim2.Init.RepetitionCounter = 0;
  tim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_PWM_Init(&tim2) != HAL_OK)
    Error_Handler();

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&tim2, &sClockSourceConfig) != HAL_OK)
    Error_Handler();

  PWM_Config2.OCMode = TIM_OCMODE_PWM1;
  PWM_Config2.Pulse = 110;
  PWM_Config2.OCPolarity = TIM_OCPOLARITY_HIGH;
  PWM_Config2.OCFastMode = TIM_OCFAST_DISABLE;
  PWM_Config2.OCIdleState = TIM_OCIDLESTATE_RESET;
  PWM_Config2.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  if (HAL_TIM_PWM_ConfigChannel(&tim2, &PWM_Config2, TIM_CHANNEL_4) != HAL_OK)
    Error_Handler();

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&tim2, &sMasterConfig) != HAL_OK)
    Error_Handler();
}

void Init_TIM3() {
  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  __HAL_RCC_TIM3_CLK_ENABLE();
  tim3.Instance = TIM3;
  tim3.Init.Prescaler = 0;
  tim3.Init.CounterMode = TIM_COUNTERMODE_UP;
  tim3.Init.Period = 2000;
  tim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV2;
  tim3.Init.RepetitionCounter = 0;
  tim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&tim3) != HAL_OK)
    Error_Handler();

  if (HAL_TIM_GenerateEvent(&tim3, TIM_EVENTSOURCE_UPDATE) != HAL_OK)
    Error_Handler();

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE;
  if (HAL_TIMEx_MasterConfigSynchronization(&tim3, &sMasterConfig) != HAL_OK)
    Error_Handler();

  HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_2);
  HAL_NVIC_SetPriority(TIM3_IRQn, 1, 3);
  HAL_NVIC_EnableIRQ(TIM3_IRQn);
}

void Init_TIM4() {
  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};
  TIM_SlaveConfigTypeDef sSlaveConfig = {0};

  __HAL_RCC_TIM4_CLK_ENABLE();
  tim4.Instance = TIM4;
  tim4.Init.Prescaler = 0;
  tim4.Init.CounterMode = TIM_COUNTERMODE_UP;
  tim4.Init.Period = 1800;
  tim4.Init.ClockDivision = TIM_CLOCKDIVISION_DIV2;
  tim4.Init.RepetitionCounter = 0;
  tim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&tim4) != HAL_OK)
    Error_Handler();

  sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
  sSlaveConfig.InputTrigger = TIM_TS_ITR2;
  if (HAL_TIM_SlaveConfigSynchro(&tim4, &sSlaveConfig) != HAL_OK)
    Error_Handler();

  HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_2);
  HAL_NVIC_SetPriority(TIM4_IRQn, 2, 2);
  HAL_NVIC_EnableIRQ(TIM4_IRQn);
}

void Init_TIM8() {
  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  __HAL_RCC_TIM8_CLK_ENABLE();
  tim8.Instance = TIM8;
  tim8.Init.Prescaler = 0xFFFF;
  tim8.Init.CounterMode = TIM_COUNTERMODE_UP;
  tim8.Init.Period = 1350;
  tim8.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  tim8.Init.RepetitionCounter = 0;
  tim8.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&tim8) != HAL_OK)
    Error_Handler();

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&tim8, &sClockSourceConfig) != HAL_OK)
    Error_Handler();

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&tim8, &sMasterConfig) != HAL_OK)
    Error_Handler();

  HAL_NVIC_SetPriority(TIM8_UP_TIM13_IRQn, 0, 2);
  HAL_NVIC_EnableIRQ(TIM8_UP_TIM13_IRQn);
}

void Init_UART5() {
  GPIO_InitTypeDef uart_pins;
  /** UART5 RX/TX PINS **/
  uart_pins.Pin = GPIO_PIN_12; /** DON'T FORGET TO CHOOSE THE ALTERNATIVE FUNCTION IN THE PIN CONFIGURATION **/
  uart_pins.Mode = GPIO_MODE_AF_PP;
  uart_pins.Pull = GPIO_NOPULL;
  uart_pins.Alternate = GPIO_AF14_UART5;
  HAL_GPIO_Init(GPIOB, &uart_pins);

  uart_pins.Pin = GPIO_PIN_13;
  uart_pins.Mode = GPIO_MODE_AF_PP;
  uart_pins.Pull = GPIO_NOPULL;
  //uart_pins.Alternate = GPIO_AF8_UART5;
  HAL_GPIO_Init(GPIOB, &uart_pins);
  __HAL_RCC_GPIOB_CLK_ENABLE();

  __HAL_RCC_UART5_CLK_ENABLE();
  uart5.Instance = UART5;
  uart5.pTxBuffPtr = (uint8_t *)&uart5_tx_buf[0];
  uart5.pRxBuffPtr = (uint8_t *)&uart5_rx_buf;
  uart5.hdmatx = &DMA_InitStructure;
  uart5.FifoMode = UART_FIFOMODE_DISABLE;
  uart5.Init.BaudRate = 115200;
  uart5.Init.WordLength = UART_WORDLENGTH_8B;
  uart5.Init.StopBits = UART_STOPBITS_1;
  uart5.Init.Parity = UART_PARITY_NONE;
  uart5.Init.Mode = UART_MODE_TX_RX;
  uart5.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  uart5.Init.OverSampling = UART_OVERSAMPLING_8;
  uart5.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  uart5.Init.ClockPrescaler = UART_PRESCALER_DIV16;
  uart5.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  uart5.AdvancedInit.OverrunDisable = UART_ADVFEATURE_OVERRUN_DISABLE;
  uart5.AdvancedInit.DMADisableonRxError = UART_ADVFEATURE_DMA_DISABLEONRXERROR;
  if (HAL_UART_Init(&uart5) != HAL_OK)
    Error_Handler();

