AvatarBg111/stm32h750_i2s_to_dac_converter/SEGGER_version/Source/stm32h750_init.c
  HAL_NVIC_SetPriority(UART5_IRQn, 0, 3);
  HAL_NVIC_EnableIRQ(UART5_IRQn);
  __HAL_UART_ENABLE_IT(&uart5, UART_IT_RXNE);

  /*if(HAL_UARTEx_SetTxFifoThreshold(&uart5, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)    Error_Handler();
    if(HAL_UARTEx_SetRxFifoThreshold(&uart5, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)    Error_Handler();
    if(HAL_UARTEx_DisableFifoMode(&uart5) != HAL_OK)    Error_Handler();*/
}

void Init_UART5_DMA() {
  __HAL_RCC_DMA1_CLK_ENABLE();

  DMA_InitStructure.Instance = DMA1_Stream1;
  if (HAL_DMA_DeInit(&DMA_InitStructure) != HAL_OK)
    Error_Handler();
  DMA_InitStructure.DMAmuxChannel = DMAMUX1_Channel1;
  DMA_InitStructure.Init.Request = DMA_REQUEST_UART5_TX;
  DMA_InitStructure.Init.Direction = DMA_MEMORY_TO_PERIPH;
  DMA_InitStructure.Init.PeriphInc = DMA_PINC_DISABLE;
  DMA_InitStructure.Init.MemInc = DMA_MINC_ENABLE;
  DMA_InitStructure.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  DMA_InitStructure.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  DMA_InitStructure.Init.Mode = DMA_NORMAL;
  DMA_InitStructure.Init.Priority = DMA_PRIORITY_MEDIUM;
  DMA_InitStructure.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
  DMA_InitStructure.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL;
  DMA_InitStructure.Init.MemBurst = DMA_MBURST_SINGLE;
  DMA_InitStructure.Init.PeriphBurst = DMA_PBURST_SINGLE;
  if (HAL_DMA_Init(&DMA_InitStructure) != HAL_OK)
    Error_Handler();

  HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, 1, 4);
  HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);
}

void Init_SPI1() {
  GPIO_InitTypeDef spi_pin;

  /** SPI1 PINS **/
  __HAL_RCC_SPI123_CONFIG(RCC_SPI123CLKSOURCE_PLL);
  __HAL_RCC_GPIOA_CLK_ENABLE();

  spi_pin.Pin = GPIO_PIN_5;
  spi_pin.Mode = GPIO_MODE_AF_PP;
  spi_pin.Pull = GPIO_NOPULL;
  spi_pin.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  spi_pin.Alternate = GPIO_AF5_SPI1;
  HAL_GPIO_Init(GPIOA, &spi_pin);

  spi_pin.Pin = GPIO_PIN_7;
  spi_pin.Mode = GPIO_MODE_AF_PP;
  spi_pin.Pull = GPIO_NOPULL;
  spi_pin.Alternate = GPIO_AF5_SPI1;
  HAL_GPIO_Init(GPIOA, &spi_pin);

  spi_pin.Pin = GPIO_PIN_6;
  spi_pin.Mode = GPIO_MODE_OUTPUT_PP;
  spi_pin.Pull = GPIO_PULLUP;
  spi_pin.Alternate = NULL;
  HAL_GPIO_Init(GPIOA, &spi_pin);

  __HAL_RCC_SPI1_CLK_ENABLE();
  spi1.Instance = SPI1;
  spi1.Init.Mode = SPI_MODE_MASTER;
  spi1.Init.Direction = SPI_DIRECTION_2LINES_TXONLY;
  spi1.Init.DataSize = SPI_DATASIZE_8BIT;
  spi1.Init.CLKPolarity = SPI_POLARITY_HIGH;
  spi1.Init.CLKPhase = SPI_PHASE_2EDGE;
  spi1.Init.NSS = SPI_NSS_SOFT;
  spi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_32;
  spi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  spi1.Init.TIMode = SPI_TIMODE_DISABLE;
  spi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  spi1.Init.CRCPolynomial = 0x0;
  spi1.Init.NSSPMode = SPI_NSS_PULSE_DISABLED;
  spi1.Init.MasterKeepIOState = SPI_MASTER_KEEP_IO_STATE_DISABLE;
  if (HAL_SPI_DeInit(&spi1) != HAL_OK)
    Error_Handler();
  if (HAL_SPI_Init(&spi1) != HAL_OK)
    Error_Handler();
}

void Init_RTC() {
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
  RTC_TimeTypeDef sTime = {0};
  RTC_DateTypeDef sDate = {0};

  //__HAL_RCC_PWR_CLK_ENABLE();//Enable power clock PWR
  HAL_PWR_EnableBkUpAccess(); //Cancel the write protection of the backup area

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSE; //LSE configuration
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON; //RTC uses LSE
  HAL_RCC_OscConfig(&RCC_OscInitStruct);

  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC; //The external setting is RTC
  PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSE; //RTC clock source is LSE
  HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);

  __HAL_RCC_RTC_ENABLE(); //RTC clock enable

  hrtc.Instance = RTC;
  hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
  hrtc.Init.AsynchPrediv = 127;
  hrtc.Init.SynchPrediv = 255;
  hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
  hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
  hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
  hrtc.Init.OutPutRemap = RTC_OUTPUT_REMAP_NONE;
  if (HAL_RTC_Init(&hrtc) != HAL_OK)
    Error_Handler();
  if (HAL_RTC_WaitForSynchro(&hrtc) != HAL_OK)
    Error_Handler();

  sTime.Hours = 0x0;
  sTime.Minutes = 0x0;
  sTime.Seconds = 0x0;
  sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
  sTime.StoreOperation = RTC_STOREOPERATION_RESET;
  if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK)
    Error_Handler();

  sDate.WeekDay = RTC_WEEKDAY_MONDAY;
  sDate.Month = RTC_MONTH_JANUARY;
  sDate.Date = 0x1;
  sDate.Year = 0x0;
  if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK)
    Error_Handler();
}

void print_frequencies(){
  uint32_t sys_clock = HAL_RCC_GetSysClockFreq();
  uint32_t hclk = HAL_RCC_GetHCLKFreq();
  uint32_t pclk1 = HAL_RCC_GetPCLK1Freq();
  uint32_t pclk2 = HAL_RCC_GetPCLK2Freq();

  printf("\n\tsys_clock:%d hclk:%d pclk1:%d pclk2:%d", sys_clock, hclk, pclk1, pclk2);
}